In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os

# Part 1

In [2]:
path = r'C:\Users\nikik\17-12-2025 Instacart Basket Analysis'

# Import new customer data set as a dataframe.

In [3]:
# Import customer data file
df_customers = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_customers.shape

(206209, 10)

# Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [21]:
# Renaming columns
df_customers.rename(columns = {'first name': 'First Name', 'Surnam': 'Surname', 'Gender': 'gender', 'STATE': 'state', 'Age': 'age', 'n_dependants': 'n_dependents', 'fam_status' :'family_status'}, inplace = True)

In [22]:
# check the output
df_customers.head()

,user_id,First Name,Surname,gender,state,age,date_joined,n_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [23]:
# checkig data types
df_customers.dtypes

user_id           int32
First Name       object
Surname          object
gender           object
state            object
age               int32
date_joined      object
n_dependents      int32
family_status    object
income            int32
dtype: object

In [24]:
# keeping necessary columns
#df_customers = df_customers[['user_id', 'gender', 'age', 'n_dependents', 'income']]

In [25]:
# convert int64 to int32
int_cols = ['user_id', 'age', 'n_dependents', 'income']
for col in int_cols:
    df_customers[col] = df_customers[col].astype('int32')

In [42]:
df_customers.dtypes

user_id           int32
First Name       object
Surname          object
gender           object
state            object
age               int32
date_joined      object
n_dependents      int32
family_status    object
income            int32
dtype: object

# Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [26]:
df_customers.describe()

             user_id            age   n_dependents         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [27]:
# checking for mixed type data
for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].applymap(type) != df_customers
             [[col]].iloc[0].apply(type)).any(axis = 1)
    if len(df_customers[weird]) > 0:
        print(col)

In [28]:
df_customers['First Name'] = df_customers['First Name'].astype('str')

In [29]:
df_customers['First Name'].dtype

dtype('O')

# Missing values

In [30]:
# checking for missing values
df_customers.isnull().sum()

user_id          0
First Name       0
Surname          0
gender           0
state            0
age              0
date_joined      0
n_dependents     0
family_status    0
income           0
dtype: int64

In [31]:
# No missing values found

# Checking for Duplicates

In [32]:
df_dups = df_customers[df_customers.duplicated()]

In [33]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surname, gender, state, age, date_joined, n_dependents, family_status, income]
Index: []

In [34]:
# No duplicates found

# Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [35]:
# Importing the combined dataframe

df_prepared_dataframe = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_grouped.pkl'))

In [36]:
df_prepared_dataframe.shape

(32404859, 26)

In [39]:
df_prepared_dataframe.dtypes

product_id                       int64
product_name                    object
aisle_id                         int64
department_id                    int64
prices                         float64
Unnamed: 0.1                     int64
Unnamed: 0                       int64
order_id                         int64
user_id                          int64
order_number                     int64
orders_day_of_week               int64
order_hour_of_day                int64
days_since_prior_order         float64
add_to_cart_order                int64
reordered                        int64
_merge                        category
price_range_loc                 object
busiest_day                     object
busiest_days                    object
busiest_period_of_day           object
max_order                        int64
loyalty_flag                    object
avg_product_price              float64
spending_flag                   object
median_days_between_orders     float64
order_frequency_flag            object
dtype: object

In [40]:
df_prepared_dataframe.head()

,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_product_price,spending_flag,median_days_between_orders,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,1987,3139998,138,28,...,Mid-range product,Regularly busy,Regular days,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1989,1977647,138,30,...,Mid-range product,Regularly busy,Regular days,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,11433,11433,389851,709,2,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,6.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,12198,12198,652770,764,1,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,12200,12200,1813452,764,3,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [41]:
# columns to keep
cols_to_keep = ['order_id', 'user_id', 'order_hour_of_day', 'prices', 'loyalty_flag', 'department_id', 'product_name', 'product_id']
df_prepared_dataframe = df_prepared_dataframe[cols_to_keep]

In [43]:
# convert int64 to int32
int_cols = ['product_id', 'department_id', 'user_id', 'order_id', 'order_hour_of_day']
for col in int_cols:
    df_prepared_dataframe[col] = df_prepared_dataframe[col].astype('int32')

<ipython-input-43-11fcf8a0820f>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_prepared_dataframe[col] = df_prepared_dataframe[col].astype('int32')

In [44]:
# checking key columns are same
df_prepared_dataframe['user_id'].dtype

dtype('int32')

In [45]:
df_prepared_dataframe['user_id'].dtype

dtype('int32')

In [46]:
# checking unique values
df_prepared_dataframe['user_id'].nunique()

206209

In [47]:
df_customers['user_id'].nunique()

206209

In [48]:
df_merging = df_prepared_dataframe.merge(df_customers, on = 'user_id', how ='left')

In [49]:
df_merging.head()

,order_id,user_id,order_hour_of_day,prices,loyalty_flag,department_id,product_name,product_id,First Name,Surname,gender,state,age,date_joined,n_dependents,family_status,income
0,3139998,138,11,5.8,Regular customer,19,Chocolate Sandwich Cookies,1,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1977647,138,17,5.8,Regular customer,19,Chocolate Sandwich Cookies,1,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,389851,709,21,5.8,New customer,19,Chocolate Sandwich Cookies,1,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302
3,652770,764,13,5.8,New customer,19,Chocolate Sandwich Cookies,1,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308
4,1813452,764,17,5.8,New customer,19,Chocolate Sandwich Cookies,1,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308

In [50]:
df_merging.shape

(32404859, 17)

# Exporting new dataframe as pickle file

In [51]:
df_merging.to_pickle(os.path.join(path, 'Data','Prepared Data', 'dataframe_new.pkl'))